# CanSetValue Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorFillSchemeEntry..::..CanSetValue Method
ColorFillSchemeEntry Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanSetValue(Double) | Checks whether StorageType of entry is Double and the value is no less than 0.0. |
| CanSetValue(Int32) | Checks whether StorageType of entry is Integer. |
| CanSetValue(ElementId) | Checks whether StorageType of entry is ElementId. |

# See Also
ColorFillSchemeEntry Class
ColorFillSchemeEntry Members
Autodesk.Revit.DB Namespace